# Terraform - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging/runs/run-SzGRnBmXASted9VN

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.organization.tfe_variable.organization_api_aws_access_key_id: Refreshing state... [id=var-ZL9dNSWq5koZMEdK]
module.organization.tfe_variable.organization_api_cockroach_api_key: Refreshing state... [id=var-4HiP4pWTx2vmuETG]
module.identity.tfe_variable.identity_aws_secret_access_key: Refreshing state... [id=var-imyodC81fxTHWc3Z]
module.organization.tfe_variable.organization_aws_secret_access_key: Refreshing state... [id=var-Sf6PotsjU3w4q9LJ]
module.customer.tfe_workspace.customer: Refreshing state... [id=ws-AbQ1UdiNbbr6LsjT]
module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-zaNMyLE6UBB5jXkk]
module.shared.tfe_variable.shared_aws_access_key_id: Refreshing state... [id=var-zMjpvJDHmWoCv6jB]
module.organization.tfe_variable.organization_cockroach_api_key: Refreshing state... [id=var-ii2KRcur1EZvb1R1]
module.organization.tfe_variable.organization_aws_access_key_id: Refreshing state... [id=var-4RzdzxYxvNLjNoBq]
module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-DFQhZrpRudi1YxmE]
module.identity.tfe_variable.identity_api_aws_access_key_id: Refreshing state... [id=var-wwNHEHTzsWGo9wF7]
module.identity.tfe_variable.identity_aws_access_key_id: Refreshing state... [id=var-NAprvbdaTUoUr5AT]
module.customer.tfe_variable.customer_api_aws_secret_access_key: Refreshing state... [id=var-2vgVfpAfxkN9HUBt]
module.shared.tfe_workspace.shared: Refreshing state... [id=ws-2RvdngF7UqEML1LV]
module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-3saeTSfth8ceA3f4]
module.customer.tfe_variable.customer_api_cockroach_api_key: Refreshing state... [id=var-ibaHupv7Pr5jBGRV]
module.organization.tfe_variable.organization_api_aws_secret_access_key: Refreshing state... [id=var-LQsh3YL8Ya2X9Gmh]
tfe_project.default: Refreshing state... [id=prj-C7gU6BPKhfZ8WHak]
module.identity.tfe_variable.identity_cockroach_api_key: Refreshing state... [id=var-dbF8jaNMsf4HCgdY]
module.identity.tfe_variable.identity_api_aws_secret_access_key: Refreshing state... [id=var-gEEoxv638c4yiW4E]
module.identity.tfe_workspace.identity: Refreshing state... [id=ws-jotVYSRv58PvMnX7]
module.customer.tfe_variable.customer_api_aws_access_key_id: Refreshing state... [id=var-FVC2cesH2CYwkWg3]
module.identity.tfe_variable.identity_api_cockroach_api_key: Refreshing state... [id=var-aBFvWcLhiaeCY2dL]
module.shared.tfe_variable.shared_cockroach_api_key: Refreshing state... [id=var-wh1bqkhmS3vShxL7]
module.customer.tfe_variable.customer_aws_access_key_id: Refreshing state... [id=var-Zkgyr46UPaRXr7sR]
module.customer.tfe_variable.customer_aws_secret_access_key: Refreshing state... [id=var-UWLYZmyrEadWXHh6]
module.organization.tfe_workspace.organization: Refreshing state... [id=ws-4A6AuKxyDYFDDHAD]
module.shared.tfe_variable.shared_aws_secret_access_key: Refreshing state... [id=var-p2ePQdmVELsUBeRp]
module.customer.tfe_variable.customer_cockroach_api_key: Refreshing state... [id=var-TYLKyFyCf8QCcFRB]
module.common.data.tfe_organization.default: Refreshing...
module.common.data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
module.common.data.tfe_workspace.default: Refreshing...
module.common.data.tfe_workspace.default: Refresh complete after 0s [id=ws-wwXQa69M62VYdb4M]
module.common.data.tfe_variables.default: Refreshing...
module.common.data.tfe_variables.default: Refresh complete after 1s [id=variables/ws-wwXQa69M62VYdb4M]
module.organization.tfe_workspace.organization: Drift detected (update)
module.organization.tfe_workspace.organization_api: Drift detected (update)
module.shared.tfe_workspace.shared: Drift detected (update)
module.customer.tfe_workspace.customer: Drift detected (update)
module.customer.tfe_workspace.customer_api: Drift detected (update)
module.identity.tfe_workspace.identity: Drift detected (update)
module.identity.tfe_workspace.identity_api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # tfe_project.default will be destroyed
  # (because tfe_project.default is not in configuration)
  - resource "tfe_project" "default" {
      - id           = "prj-C7gU6BPKhfZ8WHak" -> null
      - name         = "staging" -> null
      - organization = "connectilly" -> null
    }

  # module.common.tfe_project.default will be created
  + resource "tfe_project" "default" {
      + id           = (known after apply)
      + name         = "staging"
      + organization = "connectilly"
    }

  # module.customer.tfe_variable.customer_api_aws_access_key_id will be destroyed
  # (because tfe_variable.customer_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "customer_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-FVC2cesH2CYwkWg3" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-DFQhZrpRudi1YxmE" -> null
    }

  # module.customer.tfe_variable.customer_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.customer_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "customer_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-2vgVfpAfxkN9HUBt" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-DFQhZrpRudi1YxmE" -> null
    }

  # module.customer.tfe_variable.customer_api_cockroach_api_key will be destroyed
  # (because tfe_variable.customer_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "customer_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-ibaHupv7Pr5jBGRV" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-DFQhZrpRudi1YxmE" -> null
    }

  # module.customer.tfe_variable.customer_aws_access_key_id will be destroyed
  # (because tfe_variable.customer_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "customer_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-Zkgyr46UPaRXr7sR" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-AbQ1UdiNbbr6LsjT" -> null
    }

  # module.customer.tfe_variable.customer_aws_secret_access_key will be destroyed
  # (because tfe_variable.customer_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "customer_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-UWLYZmyrEadWXHh6" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-AbQ1UdiNbbr6LsjT" -> null
    }

  # module.customer.tfe_variable.customer_cockroach_api_key will be destroyed
  # (because tfe_variable.customer_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "customer_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-TYLKyFyCf8QCcFRB" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-AbQ1UdiNbbr6LsjT" -> null
    }

  # module.customer.tfe_workspace.customer will be destroyed
  # (because tfe_workspace.customer is not in configuration)
  - resource "tfe_workspace" "customer" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-customer" -> null
      - id                            = "ws-AbQ1UdiNbbr6LsjT" -> null
      - name                          = "staging-customer" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-C7gU6BPKhfZ8WHak" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 6 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "customer",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/customer/shared/infrastructure/workspaces/staging" -> null
    }

  # module.customer.tfe_workspace.customer_api will be destroyed
  # (because tfe_workspace.customer_api is not in configuration)
  - resource "tfe_workspace" "customer_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-customer-api" -> null
      - id                            = "ws-DFQhZrpRudi1YxmE" -> null
      - name                          = "staging-customer-api" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-C7gU6BPKhfZ8WHak" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 16 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "customer",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/customer/customer-api/infrastructure/workspaces/staging" -> null
    }

  # module.identity.tfe_variable.identity_api_aws_access_key_id will be destroyed
  # (because tfe_variable.identity_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "identity_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-wwNHEHTzsWGo9wF7" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-3saeTSfth8ceA3f4" -> null
    }

  # module.identity.tfe_variable.identity_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.identity_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "identity_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-gEEoxv638c4yiW4E" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-3saeTSfth8ceA3f4" -> null
    }

  # module.identity.tfe_variable.identity_api_cockroach_api_key will be destroyed
  # (because tfe_variable.identity_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "identity_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-aBFvWcLhiaeCY2dL" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-3saeTSfth8ceA3f4" -> null
    }

  # module.identity.tfe_variable.identity_aws_access_key_id will be destroyed
  # (because tfe_variable.identity_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "identity_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-NAprvbdaTUoUr5AT" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-jotVYSRv58PvMnX7" -> null
    }

  # module.identity.tfe_variable.identity_aws_secret_access_key will be destroyed
  # (because tfe_variable.identity_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "identity_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-imyodC81fxTHWc3Z" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-jotVYSRv58PvMnX7" -> null
    }

  # module.identity.tfe_variable.identity_cockroach_api_key will be destroyed
  # (because tfe_variable.identity_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "identity_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-dbF8jaNMsf4HCgdY" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-jotVYSRv58PvMnX7" -> null
    }

  # module.identity.tfe_workspace.identity will be destroyed
  # (because tfe_workspace.identity is not in configuration)
  - resource "tfe_workspace" "identity" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-identity" -> null
      - id                            = "ws-jotVYSRv58PvMnX7" -> null
      - name                          = "staging-identity" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-C7gU6BPKhfZ8WHak" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 6 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "identity",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/identity/shared/infrastructure/workspaces/staging" -> null
    }

  # module.identity.tfe_workspace.identity_api will be destroyed
  # (because tfe_workspace.identity_api is not in configuration)
  - resource "tfe_workspace" "identity_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-identity-api" -> null
      - id                            = "ws-3saeTSfth8ceA3f4" -> null
      - name                          = "staging-identity-api" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-C7gU6BPKhfZ8WHak" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 16 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "identity",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/identity/identity-api/infrastructure/workspaces/staging" -> null
    }

  # module.organization.tfe_variable.organization_api_aws_access_key_id will be destroyed
  # (because tfe_variable.organization_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "organization_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-ZL9dNSWq5koZMEdK" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-zaNMyLE6UBB5jXkk" -> null
    }

  # module.organization.tfe_variable.organization_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.organization_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "organization_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-LQsh3YL8Ya2X9Gmh" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-zaNMyLE6UBB5jXkk" -> null
    }

  # module.organization.tfe_variable.organization_api_cockroach_api_key will be destroyed
  # (because tfe_variable.organization_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "organization_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-4HiP4pWTx2vmuETG" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-zaNMyLE6UBB5jXkk" -> null
    }

  # module.organization.tfe_variable.organization_aws_access_key_id will be destroyed
  # (because tfe_variable.organization_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "organization_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-4RzdzxYxvNLjNoBq" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-4A6AuKxyDYFDDHAD" -> null
    }

  # module.organization.tfe_variable.organization_aws_secret_access_key will be destroyed
  # (because tfe_variable.organization_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "organization_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-Sf6PotsjU3w4q9LJ" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-4A6AuKxyDYFDDHAD" -> null
    }

  # module.organization.tfe_variable.organization_cockroach_api_key will be destroyed
  # (because tfe_variable.organization_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "organization_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-ii2KRcur1EZvb1R1" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-4A6AuKxyDYFDDHAD" -> null
    }

  # module.organization.tfe_workspace.organization will be destroyed
  # (because tfe_workspace.organization is not in configuration)
  - resource "tfe_workspace" "organization" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-organization" -> null
      - id                            = "ws-4A6AuKxyDYFDDHAD" -> null
      - name                          = "staging-organization" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-C7gU6BPKhfZ8WHak" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 6 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "organization",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/organization/shared/infrastructure/workspaces/staging" -> null
    }

  # module.organization.tfe_workspace.organization_api will be destroyed
  # (because tfe_workspace.organization_api is not in configuration)
  - resource "tfe_workspace" "organization_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-organization-api" -> null
      - id                            = "ws-zaNMyLE6UBB5jXkk" -> null
      - name                          = "staging-organization-api" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-C7gU6BPKhfZ8WHak" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 16 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "organization",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/organization/organization-api/infrastructure/workspaces/staging" -> null
    }

  # module.shared.tfe_variable.shared_aws_access_key_id will be destroyed
  # (because tfe_variable.shared_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "shared_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-zMjpvJDHmWoCv6jB" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-2RvdngF7UqEML1LV" -> null
    }

  # module.shared.tfe_variable.shared_aws_secret_access_key will be destroyed
  # (because tfe_variable.shared_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "shared_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-p2ePQdmVELsUBeRp" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-2RvdngF7UqEML1LV" -> null
    }

  # module.shared.tfe_variable.shared_cockroach_api_key will be destroyed
  # (because tfe_variable.shared_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "shared_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-wh1bqkhmS3vShxL7" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-2RvdngF7UqEML1LV" -> null
    }

  # module.shared.tfe_workspace.shared will be destroyed
  # (because tfe_workspace.shared is not in configuration)
  - resource "tfe_workspace" "shared" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-shared" -> null
      - id                            = "ws-2RvdngF7UqEML1LV" -> null
      - name                          = "staging-shared" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-C7gU6BPKhfZ8WHak" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 2 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "shared",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/shared/infrastructure/workspaces/staging" -> null
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_access_key_id will be created
  + resource "tfe_variable" "customer_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_cockroach_api_key will be created
  + resource "tfe_variable" "customer_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_upstash_api_key will be created
  + resource "tfe_variable" "customer_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_aws_access_key_id will be created
  + resource "tfe_variable" "customer_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_cockroach_api_key will be created
  + resource "tfe_variable" "customer_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_upstash_api_key will be created
  + resource "tfe_variable" "customer_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_workspace.customer will be created
  + resource "tfe_workspace" "customer" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-customer"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "customer",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/shared/infrastructure/workspaces/staging"
    }

  # module.common.module.customer.tfe_workspace.customer_api will be created
  + resource "tfe_workspace" "customer_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-customer-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "customer",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/customer-api/infrastructure/workspaces/staging"
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_access_key_id will be created
  + resource "tfe_variable" "identity_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_secret_access_key will be created
  + resource "tfe_variable" "identity_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_cockroach_api_key will be created
  + resource "tfe_variable" "identity_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_upstash_api_key will be created
  + resource "tfe_variable" "identity_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_aws_access_key_id will be created
  + resource "tfe_variable" "identity_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_aws_secret_access_key will be created
  + resource "tfe_variable" "identity_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_cockroach_api_key will be created
  + resource "tfe_variable" "identity_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_upstash_api_key will be created
  + resource "tfe_variable" "identity_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_workspace.identity will be created
  + resource "tfe_workspace" "identity" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-identity"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "identity",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/identity/shared/infrastructure/workspaces/staging"
    }

  # module.common.module.identity.tfe_workspace.identity_api will be created
  + resource "tfe_workspace" "identity_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-identity-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "identity",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/identity/identity-api/infrastructure/workspaces/staging"
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_access_key_id will be created
  + resource "tfe_variable" "organization_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_secret_access_key will be created
  + resource "tfe_variable" "organization_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_cockroach_api_key will be created
  + resource "tfe_variable" "organization_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_upstash_api_key will be created
  + resource "tfe_variable" "organization_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_aws_access_key_id will be created
  + resource "tfe_variable" "organization_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_aws_secret_access_key will be created
  + resource "tfe_variable" "organization_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_cockroach_api_key will be created
  + resource "tfe_variable" "organization_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_upstash_api_key will be created
  + resource "tfe_variable" "organization_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_workspace.organization will be created
  + resource "tfe_workspace" "organization" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-organization"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "organization",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/organization/shared/infrastructure/workspaces/staging"
    }

  # module.common.module.organization.tfe_workspace.organization_api will be created
  + resource "tfe_workspace" "organization_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-organization-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "organization",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/organization/organization-api/infrastructure/workspaces/staging"
    }

  # module.common.module.shared.tfe_variable.shared_aws_access_key_id will be created
  + resource "tfe_variable" "shared_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_variable.shared_aws_secret_access_key will be created
  + resource "tfe_variable" "shared_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_variable.shared_cockroach_api_key will be created
  + resource "tfe_variable" "shared_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_variable.shared_upstash_api_key will be created
  + resource "tfe_variable" "shared_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_workspace.shared will be created
  + resource "tfe_workspace" "shared" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-shared"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "shared",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/shared/infrastructure/workspaces/staging"
    }

Plan: 36 to add, 0 to change, 29 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*